БухЭксп/Catalogs/CW_ГруппыСогласования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>CW_ГруппыСогласования</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>СписокСотрудников</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пользователь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Должность</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

БухЭксп/Catalogs/CW_ГруппыСогласования/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Функция ТекущийПользовательВГруппеСогласования(ГруппаСогласования) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ГруппыСогласованияДоговоровСписокСотрудников.Пользователь КАК Пользователь
	               |ИЗ
	               |	Справочник.CW_ГруппыСогласования.СписокСотрудников КАК CW_ГруппыСогласованияДоговоровСписокСотрудников
	               |ГДЕ
	               |	CW_ГруппыСогласованияДоговоровСписокСотрудников.Ссылка = &ГруппаСогласования
	               |	И CW_ГруппыСогласованияДоговоровСписокСотрудников.Пользователь = &Пользователь";
	
	Запрос.УстановитьПараметр("ГруппаСогласования", ГруппаСогласования);
	Запрос.УстановитьПараметр("Пользователь", 		ПараметрыСеанса.ТекущийПользователь);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат Не РезультатЗапроса.Пустой();
	
КонецФункции

Функция ПолучитьПервогоПользователяГруппыСогласования(ГруппаСогласования) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	CW_ГруппыСогласованияДоговоровСписокСотрудников.Пользователь КАК Пользователь
	               |ИЗ
	               |	Справочник.CW_ГруппыСогласования.СписокСотрудников КАК CW_ГруппыСогласованияДоговоровСписокСотрудников
	               |ГДЕ
	               |	CW_ГруппыСогласованияДоговоровСписокСотрудников.Ссылка = &ГруппаСогласования
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	CW_ГруппыСогласованияДоговоровСписокСотрудников.НомерСтроки";
	
	Запрос.УстановитьПараметр("ГруппаСогласования", ГруппаСогласования);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Пользователь;
	КонецЕсли;
	
	Возврат ПредопределенноеЗначение("Справочник.Пользователи.ПустаяСсылка");
	
КонецФункции

Функция ПолучитьГруппыСогласованияПользователя(Пользователь = Неопределено) Экспорт
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ГруппыСогласованияДоговоровСписокСотрудников.Ссылка КАК ГруппаСогласования
	               |ИЗ
	               |	Справочник.CW_ГруппыСогласования.СписокСотрудников КАК CW_ГруппыСогласованияДоговоровСписокСотрудников
	               |ГДЕ
	               |	CW_ГруппыСогласованияДоговоровСписокСотрудников.Пользователь = &Пользователь
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	CW_ГруппыСогласованияДоговоровСписокСотрудников.Ссылка";
	
	Запрос.УстановитьПараметр("Пользователь", ?(Пользователь=Неопределено, ПараметрыСеанса.ТекущийПользователь, Пользователь));
	
	Результат = Новый Массив;
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Результат.Добавить(Выборка.ГруппаСогласования);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьСписокПользователейГруппыСогласования(ГруппаСогласования) Экспорт
	
	Возврат ГруппаСогласования.СписокСотрудников.ВыгрузитьКолонку("Пользователь");
	
КонецФункции

#КонецЕсли
